Cinema/src/DataProcessors/ЗагрузкаВыгрузкаИзображений/ЗагрузкаВыгрузкаИзображений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВыгрузкаИзображений</name>
</mdclass:DataProcessor>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/DataProcessors/ЗагрузкаВыгрузкаИзображений/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СоздатьЭлементыУправленияНаСервереБезКонтекста(ЭтотОбъект);
	
	УстановитьУсловноеОформлениеНаСервере();
	
	ЗаполнитьТаблицуИзображенийНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ЭлементКоллекции = ЭтотОбъект.ТаблицаДанных.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ЭлементКоллекции <> Неопределено Тогда
		ИмяКолонки = СтрЗаменить(Поле.Имя, "ТаблицаДанных", "");
		ПоказатьЗначение( , ЭлементКоллекции[ИмяКолонки]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайламОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(ЭтотОбъект.ПутьКФайлам) Тогда
		Возврат;
	КонецЕсли;
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64
	Тогда
#Если ТонкийКлиент ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		КомандаСистемы("""""%ProgramFiles%\Internet Explorer\iexplore.exe"""" " + ЭтотОбъект.ПутьКФайлам);
#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицуИзображений(Команда)

	ЗаполнитьТаблицуИзображенийНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИзображения(Команда)

	ВыбратьКаталогИВыполнитьДействие(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображения(Команда)

	ВыбратьКаталогИВыполнитьДействие(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзображения(Команда)

	ОбновитьИзображенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайламОчистка(Команда)

	ЭтотОбъект.ПутьКФайлам = "";

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьЗапросом(Команда)

	Конструктор  = Новый КонструкторЗапроса;
	Обещание     = Конструктор.ОткрытьАсинх();
	ТекстЗапроса = Ждать Обещание;
	
	Если ТипЗнч(ТекстЗапроса) = Тип("Строка") Тогда
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ЗаполнитьЗапросомНаСервере(ТекстЗапроса);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

&НаСервереБезКонтекста
Процедура СоздатьЭлементыУправленияНаСервереБезКонтекста(Форма)

	// Реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТаблицаДанных", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаВыхода", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УИд", Новый ОписаниеТипов("УникальныйИдентификатор"), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВысотаИзображения", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ШиринаИзображения", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СтарыйРазмер", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НовыйРазмер", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НоваяКартинка", Новый ОписаниеТипов("Картинка"), "ТаблицаДанных"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПутьКФайлам", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная))));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("МаксимальныйРазмерИзображения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный))));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("мМинимальныйРазмерИзображения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный))));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредельноеКоличество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный))));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма.МаксимальныйРазмерИзображения = Константы.МаксимальныйРазмерИзображения.Получить();
	
	ТекущаяТаблицаДанных = Форма.РеквизитФормыВЗначение("ТаблицаДанных", Тип("ТаблицаЗначений"));
	
	// Элементы формы
	ГруппаНастройки = Форма.Элементы.Добавить("Настройки", Тип("ГруппаФормы"));
	ГруппаНастройки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастройки.Заголовок = НСтр("ru = 'Настройки'");
	ГруппаНастройки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//мМинимальныйРазмерИзображения = Форма.Элементы.Добавить("мМинимальныйРазмерИзображения", Тип("ПолеФормы"), ГруппаНастройки);
	//мМинимальныйРазмерИзображения.Вид = ВидПоляФормы.ПолеВвода;
	//мМинимальныйРазмерИзображения.ПутьКДанным = "мМинимальныйРазмерИзображения";
	//мМинимальныйРазмерИзображения.Заголовок = НСтр("ru = 'Мин. размер'");
	//мМинимальныйРазмерИзображения.КнопкаРегулирования = Истина;
	//мМинимальныйРазмерИзображения.КнопкаОчистки = Истина;

	МаксимальныйРазмерИзображения = Форма.Элементы.Добавить("МаксимальныйРазмерИзображения", Тип("ПолеФормы"), ГруппаНастройки);
	МаксимальныйРазмерИзображения.Вид = ВидПоляФормы.ПолеВвода;
	МаксимальныйРазмерИзображения.ПутьКДанным = "МаксимальныйРазмерИзображения";
	МаксимальныйРазмерИзображения.Заголовок = НСтр("ru = 'Макс. размер'");
	МаксимальныйРазмерИзображения.КнопкаРегулирования = Истина;
	
	ПредельноеКоличество = Форма.Элементы.Добавить("ПредельноеКоличество", Тип("ПолеФормы"), ГруппаНастройки);
	ПредельноеКоличество.Вид = ВидПоляФормы.ПолеВвода;
	ПредельноеКоличество.ПутьКДанным = "ПредельноеКоличество";
	ПредельноеКоличество.Заголовок = НСтр("ru = 'Предельное кол-во'");
	ПредельноеКоличество.КнопкаРегулирования = Истина;
	ПредельноеКоличество.КнопкаОчистки = Истина;

	НадписьКоличествоСтрок = Форма.Элементы.Добавить("НадписьКоличествоСтрок", Тип("ДекорацияФормы"), ГруппаНастройки);
	НадписьКоличествоСтрок.Вид = ВидДекорацииФормы.Надпись;
	НадписьКоличествоСтрок.Заголовок = НСтр("ru = 'Количество строк: 0'");
	
	// Элементы формы
	НастройкиВыгрузки = Форма.Элементы.Добавить("НастройкиВыгрузки", Тип("ГруппаФормы"));
	НастройкиВыгрузки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НастройкиВыгрузки.Заголовок = НСтр("ru = 'Настройки выгрузки/загрузки'");
	НастройкиВыгрузки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПутьКФайлам = Форма.Элементы.Добавить("ПутьКФайлам", Тип("ПолеФормы"), НастройкиВыгрузки);
	ПутьКФайлам.Вид = ВидПоляФормы.ПолеВвода;
	ПутьКФайлам.ПутьКДанным = "ПутьКФайлам";
	ПутьКФайлам.Заголовок = НСтр("ru = 'Путь к файлам'");
	ПутьКФайлам.ТолькоПросмотр = Истина;
	ПутьКФайлам.КнопкаОткрытия = Истина;
	ПутьКФайлам.УстановитьДействие("Открытие", "ПутьКФайламОткрытие");
	
	ТаблицаФормы = Форма.Элементы.Добавить("ТаблицаДанных", Тип("ТаблицаФормы"), Форма);
	ТаблицаФормы.ПутьКДанным = "ТаблицаДанных";
	ТаблицаФормы.ИзменятьПорядокСтрок	= Ложь;
	ТаблицаФормы.ИзменятьСоставСтрок	= Ложь;
	ТаблицаФормы.УстановитьДействие("Выбор", "ТаблицаДанныхВыбор");
	ГруппаКолонок = Форма.Элементы.Добавить("ТаблицаДанныхНоваяГруппа", Тип("ГруппаФормы"), ТаблицаФормы);
	ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;

	Для каждого ТекКолонка Из ТекущаяТаблицаДанных.Колонки Цикл
		ИмяКолонки = ТекКолонка.Имя;
		НоваяКолонка = Форма.Элементы.Добавить("ТаблицаДанных" + ИмяКолонки, Тип("ПолеФормы"), ?(ИмяКолонки = "НоваяКартинка", ТаблицаФормы, ГруппаКолонок));
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "ТаблицаДанных." + ИмяКолонки;
		НоваяКолонка.Высота = ?(ИмяКолонки = "НоваяКартинка", 5, 0);
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЦикла;	

	// Команды формы
	КомандаЗаполнитьТаблицу = Форма.Команды.Добавить("КомандаЗаполнитьТаблицу");
	КомандаЗаполнитьТаблицу.Действие = "ЗаполнитьТаблицуИзображений";
	КомандаЗаполнитьТаблицу.Заголовок = НСтр("ru = '1. Заполнить таблицу'");
	
	КомандаВыгрузить = Форма.Команды.Добавить("КомандаВыгрузить");
	КомандаВыгрузить.Действие = "ВыгрузитьИзображения";
	КомандаВыгрузить.Заголовок = НСтр("ru = '2. Выгрузить изображения'");
	
	КомандаЗагрузить = Форма.Команды.Добавить("КомандаЗагрузить");
	КомандаЗагрузить.Действие = "ЗагрузитьИзображения";
	КомандаЗагрузить.Заголовок = НСтр("ru = '3. Загрузить изображения'");
	
	КомандаОбновитьИзображения = Форма.Команды.Добавить("КомандаОбновитьИзображения");
	КомандаОбновитьИзображения.Действие = "ОбновитьИзображения";
	КомандаОбновитьИзображения.Заголовок = НСтр("ru = '4. Обновить изображения'");
	
	КомандаОчисткаПутьКФайлам = Форма.Команды.Добавить("КомандаОчисткаПутьКФайлам");
	КомандаОчисткаПутьКФайлам.Действие = "ПутьКФайламОчистка";
	КомандаОчисткаПутьКФайлам.Заголовок = НСтр("ru = 'Х'");
	
	КомандаЗаполнитьЗапросом = Форма.Команды.Добавить("КомандаЗаполнитьЗапросом");
	КомандаЗаполнитьЗапросом.Действие = "ЗаполнитьЗапросом";
	КомандаЗаполнитьЗапросом.Заголовок = НСтр("ru = 'Заполнить запросом'");
	КомандаЗаполнитьЗапросом.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаЗаполнитьЗапросом.Картинка = БиблиотекаКартинок.КонструкторЗапроса;
	
	// Кнопки формы
	КнопкаЗаполнитьТаблицу = Форма.Элементы.Добавить("КнопкаЗаполнитьТаблицу", Тип("КнопкаФормы"), ТаблицаФормы.КоманднаяПанель);
	КнопкаЗаполнитьТаблицу.ИмяКоманды = КомандаЗаполнитьТаблицу.Имя;
	
	КнопкаВыгрузить = Форма.Элементы.Добавить("КнопкаВыгрузить", Тип("КнопкаФормы"), ТаблицаФормы.КоманднаяПанель);
	КнопкаВыгрузить.ИмяКоманды = КомандаВыгрузить.Имя;
	
	КнопкаЗагрузить = Форма.Элементы.Добавить("КнопкаЗагрузить", Тип("КнопкаФормы"), ТаблицаФормы.КоманднаяПанель);
	КнопкаЗагрузить.ИмяКоманды = КомандаЗагрузить.Имя;
	
	КнопкаОбновитьИзображения = Форма.Элементы.Добавить("КнопкаОбновитьИзображения", Тип("КнопкаФормы"), ТаблицаФормы.КоманднаяПанель);
	КнопкаОбновитьИзображения.ИмяКоманды = КомандаОбновитьИзображения.Имя;
	
	КнопкаОчисткаПутьКФайлам = Форма.Элементы.Добавить("КнопкаОчисткаПутьКФайлам", Тип("КнопкаФормы"), НастройкиВыгрузки);
	КнопкаОчисткаПутьКФайлам.ИмяКоманды = КомандаОчисткаПутьКФайлам.Имя;
	
	ГруппаКнопокФормы       = Форма.Элементы.Добавить("ГруппаКнопокФормы", Тип("ГруппаФормы"), ТаблицаФормы.КоманднаяПанель);
	ГруппаКнопокФормы.Вид   = ВидГруппыФормы.ГруппаКнопок;
	КнопкаЗаполнитьЗапросом = Форма.Элементы.Добавить("КнопкаЗаполнитьЗапросом", Тип("КнопкаФормы"), ГруппаКнопокФормы);
	КнопкаЗаполнитьЗапросом.ИмяКоманды = КомандаЗаполнитьЗапросом.Имя;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзображенийНаСервере()
	
	ТекущаяТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных", Тип("ТаблицаЗначений"));
	ТекущаяТаблицаДанных.Очистить();
	ТекущаяТаблицаДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	
	Элементы.НадписьКоличествоСтрок.Заголовок = НСтр("ru = 'Количество строк: 0'");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.РазмерИзображения КАК СтарыйРазмер,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.ВысотаИзображения КАК ВысотаИзображения,
		|	Фильмы.ШиринаИзображения КАК ШиринаИзображения,
		|	Фильмы.Наименование КАК Наименование
		|ИЗ
		|	Константы КАК Константы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Фильмы КАК Фильмы
		|		ПО (Фильмы.РазмерИзображения > Константы.МаксимальныйРазмерИзображения)
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтарыйРазмер";
	
	Если ЭтаФорма.МаксимальныйРазмерИзображения > 0 И ЭтаФорма.мМинимальныйРазмерИзображения > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Константы.МаксимальныйРазмерИзображения", Формат(ЭтаФорма.мМинимальныйРазмерИзображения, "ЧГ=0")
									+ " И Фильмы.РазмерИзображения < " + Формат(ЭтаФорма.МаксимальныйРазмерИзображения, "ЧГ=0"));
	ИначеЕсли ЭтаФорма.МаксимальныйРазмерИзображения > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Константы.МаксимальныйРазмерИзображения", Формат(ЭтаФорма.МаксимальныйРазмерИзображения, "ЧГ=0"));
	КонецЕсли;
	
	Если ЭтаФорма.ПредельноеКоличество > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ " + Формат(ЭтаФорма.ПредельноеКоличество, "ЧГ=0"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗначениеВРеквизитФормы(ТекущаяТаблицаДанных, "ТаблицаДанных");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Фильм = Null Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТекущаяТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УИд = Выборка.Фильм.УникальныйИдентификатор();

	КонецЦикла;
	
	Элементы.НадписьКоличествоСтрок.Заголовок = СтрШаблон(НСтр("ru = 'Количество строк: %1'"), ТекущаяТаблицаДанных.Количество());
	
	ТекущаяТаблицаДанных.Сортировать("Наименование");
	
	ЗначениеВРеквизитФормы(ТекущаяТаблицаДанных, "ТаблицаДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталогИВыполнитьДействие(ЭтоВыгрузка)
	
	Если ПустаяСтрока(ЭтотОбъект.ПутьКФайлам) Тогда
		
		Описание = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект, Новый Структура("ЭтоВыгрузка", ЭтоВыгрузка));
	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Показать(Описание);
		
	Иначе
		
		Если ЭтоВыгрузка Тогда
			ВыгрузитьФайлыИзображений();
		Иначе
			ЗагрузитьФайлыИзображений();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	ЭтоВыгрузка = Ложь;
	ДополнительныеПараметры.Свойство("ЭтоВыгрузка", ЭтоВыгрузка);
	РазделительПути = ПолучитьРазделительПути();
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ПутьКФайлам = ВыбранныеФайлы.Получить(0);
		
		Если Прав(ПутьКФайлам, 1) <> РазделительПути Тогда
			ПутьКФайлам = ПутьКФайлам + РазделительПути;
			ЭтотОбъект.ПутьКФайлам = ПутьКФайлам;
		КонецЕсли;
		
		Если ЭтоВыгрузка Тогда
			ВыгрузитьФайлыИзображений();
		Иначе
			ЗагрузитьФайлыИзображений();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиСФайлом(ИнфОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	СтандартнаяОбработка = Ложь;
	ОписаниеОбОшибке     = "";
	
	Если ИнфОбОшибке.Причина = Неопределено Тогда
		ОписаниеОбОшибке = ИнфОбОшибке.Описание;
	Иначе
		ОписаниеОбОшибке = ИнфОбОшибке.Причина.Описание;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(ДополнительныеПараметры.СообщениеПользователю, ДополнительныеПараметры.ИмяФайла, ОписаниеОбОшибке);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НеСоответствуетФорматуGUID(СтрокаGUID)

	Для Сч = 1 По СтрДлина(СтрокаGUID) Цикл
		ТекСимвол = Сред(СтрокаGUID, Сч, 1);
		Если Найти("-0123456789abcdef", НРег(ТекСимвол)) = 0 Тогда
			Возврат Истина;
		КонецЕсли;
		Если Сч = 9 ИЛИ Сч = 14 ИЛИ Сч = 19 ИЛИ Сч = 24 Тогда
			Если ТекСимвол <> "-" Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеНаСервере()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДанных.Имя);
	
	ГруппаЭлементовОтбораИли = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДанных.НовыйРазмер");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = ЭтотОбъект.МаксимальныйРазмерИзображения;
	
	ГруппаЭлементовОтбораИ = ГруппаЭлементовОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДанных.НовыйРазмер");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДанных.НовыйРазмер");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Константы.МинимальныйРазмерИзображения.Получить();
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДанных.Имя);

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДанных.НовыйРазмер");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДанных.СтарыйРазмер");

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапросомНаСервере(ТекстЗапроса)
	
	ЭтаФорма.ТаблицаДанных.Очистить();

	Запрос = Новый Запрос(ТекстЗапроса);
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка выполнения запроса по причине: %1!'"), ОписаниеОшибки());
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаСсылка = Результат.Колонки.Найти("Ссылка");
	Если КолонкаСсылка = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'В выборке отсутствует колонка ""Ссылка""!'") + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если ТипЗнч(Выборка.Ссылка) <> Тип("СправочникСсылка.Фильмы") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Колонка ""Ссылка"" не является фильмом!'") + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока  = ЭтаФорма.ТаблицаДанных.Добавить();
		ТекущийФильм = Выборка.Ссылка;
		
		НоваяСтрока.Фильм = ТекущийФильм;
		НоваяСтрока.УИд   = ТекущийФильм.УникальныйИдентификатор();
		НоваяСтрока.СтарыйРазмер = ТекущийФильм.РазмерИзображения;
		НоваяСтрока.ДатаВыхода   = ТекущийФильм.ДатаВыхода;
		НоваяСтрока.ВысотаИзображения = ТекущийФильм.ВысотаИзображения;
		НоваяСтрока.ШиринаИзображения = ТекущийФильм.ШиринаИзображения;
		
	КонецЦикла;

	Элементы.НадписьКоличествоСтрок.Заголовок = СтрШаблон(НСтр("ru = 'Количество строк: %1'"), Выборка.Количество());

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаФайловИзображений

&НаКлиенте
Процедура ВыгрузитьФайлыИзображений()
	
	АдресВХранилище	= ПолучитьСписокФайловНаСервере();
	СписокФайлов	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	ПутьКФайлам		= ЭтотОбъект.ПутьКФайлам;
	
	Для каждого ТекущийФайл Из СписокФайлов Цикл
		
		ФайлКартинка = ТекущийФайл.Значение;
		ДвоичДанные  = ФайлКартинка.ПолучитьДвоичныеДанные();
		ДопПараметры = Новый Структура("ИмяФайла, СообщениеПользователю", ТекущийФайл.Ключ, НСтр("ru = 'Ошибка записи файла %1; по причине: %2.'"));
		Описание     = Новый ОписаниеОповещения( , , ДопПараметры, "ПриВозникновенииОшибкиСФайлом", ЭтотОбъект);
		ПолноеИмяФ   = ПутьКФайлам + ТекущийФайл.Ключ;
		
		ДвоичДанные.НачатьЗапись(Описание, ПолноеИмяФ);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокФайловНаСервере()

	СписокФайлов = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из ЭтотОбъект.ТаблицаДанных Цикл
		
		ЗначениеХранилища = СтрокаТаблицы.Фильм.Афиша.Получить();
		Если ЗначениеХранилища = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокФайлов.Вставить(Строка(СтрокаТаблицы.УИд) + "." + НРег(ЗначениеХранилища.Формат()), ЗначениеХранилища);
	
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(СписокФайлов, УникальныйИдентификатор);

КонецФункции

#КонецОбласти

#Область ЗагрузкаФайловИзображений

&НаКлиенте
Процедура ЗагрузитьФайлыИзображений()

	Описание = Новый ОписаниеОповещения("ПослеЗавершенияПоискаФайлов", ЭтотОбъект);
	НачатьПоискФайлов(Описание, ЭтотОбъект.ПутьКФайлам, "*.*");	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПоискаФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт

	Для каждого НайденныйФайл Из НайденныеФайлы Цикл
	
		СтрокаGUID = НайденныйФайл.ИмяБезРасширения;
		
		Если НеСоответствуетФорматуGUID(СтрокаGUID) Тогда
			Продолжить;
		КонецЕсли;
		
		ДопПараметры = Новый Структура("СтрокаGUID, ПолноеИмя", СтрокаGUID, НайденныйФайл.ПолноеИмя);
		Описание     = Новый ОписаниеОповещения("ПослеЗавершенияСозданияДвоичныхДанныхИзФайла", ЭтотОбъект, ДопПараметры);
		
		НачатьСозданиеДвоичныхДанныхИзФайла(Описание, НайденныйФайл.ПолноеИмя);
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияСозданияДвоичныхДанныхИзФайла(ДвоичныеДанные, ДополнительныеПараметры) Экспорт

	ТекущаяТаблица = ЭтотОбъект.ТаблицаДанных;
	МассивСтрок = ТекущаяТаблица.НайтиСтроки(Новый Структура("УИд", Новый УникальныйИдентификатор(ДополнительныеПараметры.СтрокаGUID)));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаКоллекции = МассивСтрок.Получить(0);
		СтрокаКоллекции.НоваяКартинка = Новый Картинка(ДвоичныеДанные);
		СтрокаКоллекции.НовыйРазмер = ДвоичныеДанные.Размер();
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеПользователю, ИмяФайла", НСтр("ru = 'Ошибка удаления файла %1. По причине %2.'"), ДополнительныеПараметры.ПолноеИмя);
	Описание = Новый ОписаниеОповещения("ПослеЗавершенияУдаленияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайлом", ЭтотОбъект);
	
	НачатьУдалениеФайлов(Описание, ДополнительныеПараметры.ПолноеИмя);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияУдаленияФайла(ДополнительныеПараметры) Экспорт
	
	Возврат;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФайловИзображений

&НаСервере
Процедура ОбновитьИзображенияНаСервере()
	
	МинимальныйРазмерИзображения  = Константы.МинимальныйРазмерИзображения.Получить();
	МаксимальныйРазмерИзображения = ЭтотОбъект.МаксимальныйРазмерИзображения;
	
	Для каждого СтрокаТаблицы Из ЭтотОбъект.ТаблицаДанных Цикл
		
		Если СтрокаТаблицы.НовыйРазмер = 0 Тогда
			Продолжить;
		ИначеЕсли СтрокаТаблицы.НовыйРазмер >= СтрокаТаблицы.СтарыйРазмер Тогда
			Продолжить;
		ИначеЕсли МинимальныйРазмерИзображения > СтрокаТаблицы.НовыйРазмер Тогда
			Продолжить;
		ИначеЕсли СтрокаТаблицы.НовыйРазмер > МаксимальныйРазмерИзображения Тогда
			Продолжить;
		КонецЕсли;
		
		СпрОбъект = СтрокаТаблицы.Фильм.ПолучитьОбъект();
		СпрОбъект.Афиша = Новый ХранилищеЗначения(СтрокаТаблицы.НоваяКартинка);
		СпрОбъект.РазмерИзображения = СтрокаТаблицы.НовыйРазмер;
		СпрОбъект.ВысотаИзображения = СтрокаТаблицы.НоваяКартинка.Высота();
		СпрОбъект.ШиринаИзображения = СтрокаТаблицы.НоваяКартинка.Ширина();
		
		Попытка
			СтрокаТаблицы.СтарыйРазмер = СтрокаТаблицы.НовыйРазмер;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка записи объекта <%1>; по причине: %2.'"), СтрокаТаблицы.Фильм, ОписаниеОшибки());
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Инициализация
#Если Сервер Тогда
	Если ПустаяСтрока(ПолучитьДействие("ПриСозданииНаСервере")) Тогда
		УстановитьДействие("ПриСозданииНаСервере", "ПриСозданииНаСервере");
	КонецЕсли;
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
#КонецЕсли
#КонецОбласти
